In [5]:
import pandas as pd

In [8]:
pd. __version__

'2.0.3'

In [9]:
s = pd.Series([1,2,3,4,5], index=['a', 'b', 'c', 'd', 'e'])

In [10]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
print(s['b'])

2

In [12]:
print(s[4])

5

In [17]:
data = {
    'Name': ['a', 'b', 'c', 'd', 'e'],
    'Salary': [1, 2, 3, 4, 5]
}

In [14]:
data

{'Name': ['a', 'b', 'c', 'd', 'e'], 'Salary': [1, 2, 3, 4, 5]}

In [18]:
data = pd.DataFrame(data)

In [24]:
data['Name']

0    a
1    b
2    c
3    d
4    e
Name: Name, dtype: object

In [25]:
data[['Name', 'Salary']]

  Name  Salary
0    a       1
1    b       2
2    c       3
3    d       4
4    e       5